[
    {
        "company": "Transact Campus",
        "jobTitle": "Senior Software Engineer",
        "startTime": "October 2022",
        "location": "Remote (Scottsdale, AZ)",
        "details": [
            "Utilized C# .NET Core, Azure Table Storage, Cosmos DB, and Azure Service Bus to build robust microservices that offered secure and reliable access to our mobile credential solution.",
            "Developed unit and integration tests using XUnit and Postman to thoroughly validate code and achieve high code coverage on all pull requests, ensuring that the codebase is of high quality.",
            "Leveraged Power BI to create comprehensive reports that highlighted key metrics on the health, performance, and usage of our credentials, providing valuable insights to stakeholders."
        ]
    },
    {
        "company": "Brooksource (Contract-to-Hire for Microsoft)",
        "jobTitle": "Full-Stack Software Engineer (Front-End Focus)",
        "startTime": "May 2022",
        "endTime": "August 2022",
        "location": "Remote (Redmond, WA)",
        "details": [
            "Hired in a contract-to-hire capacity on an hourly W2 contract. Sweeping contractor layoffs affected this role and a hiring freeze prevented me from being brought on full-time.",
            "Supported and built new functionality for React-based SharePoint webparts and extensions.",
            "Improved the current internal company communicator application for Teams (React/.NET Core/Azure Cloud Functions). The app allows internal groups to send messages across teams and individuals at scale to make mass communications on the Teams platform easier.",
            "Gained experience building pipelines, logging to application insights, creating azure dashboards from logs using kql queries, and building and deploying azure durable functions."
        ]
    },
    {
        "company": "Bluetail",
        "jobTitle": "Consulting Software Engineer",
        "startTime": "October 2021",
        "endTime": "September 2022",
        "location": "Phoenix, AZ",
        "details": [
            "Brought on in a Full-Time capacity after working contract to contract.",
            "Developed a system for more quickly getting documents into the main application. App is built with a Postgres / Express backend with a Vue Frontend. Additionally, uses tesseract for blank page and page orientation detection. This system reduced the bulk upload process time by ~50%.",
            "Helped reduce search times from 15-20 seconds to under a second."
        ]
    },
    {
        "company": "Offerpad",
        "jobTitle": "Full-Stack Software Engineer",
        "startTime": "October 2021",
        "endTime": "May 2022",
        "location": "Chandler, AZ",
        "details": [
            "Working as full stack developer on the internal application used by colleagues to help manage property buying / selling",
            "Developing backends in Azure using Web Functions, ASP.NET Core MVC, and ASP.NET MVC 5",
            "Developing UIs using React, Razor Pages, and Knockout.js",
            "Was able to contribute from day 1 and have been able to consistently contribute to user stories on a daily basis",
            "Have created and completed 100+ PRs in 6 months"
        ]
    },
    {
        "company": "American Express",
        "jobTitle": "Infrastructure Engineer II",
        "startTime": "June 2021",
        "endTime": "October 2021",
        "location": "Phoneix, AZ",
        "details": [
            "Supporting teams at the development, testing, and production levels with troubleshooting critical issues in apigee and envoy / gloo proxies",
            "Helping to deploy and maintain proxies in a ~ 3 Billion Call / Month environment",
            "Working on initiatives to help automate and improve deployment efforts (minimize manual work done for some tasks)"
        ]
    },
    {
        "company": "SAP",
        "jobTitle": "Senior Agile Developer",
        "endTime": "May 2021",
        "startTime": "December 2016",
        "location": "Tempe, AZ",
        "details": [
            "Experience Creating UI's from scratch (Manage Planning Configuration Sets, Manage Option Plans, Manage Category Assortments) and working with UIs of existing applications (Manage Promotional Offers, Manage Offer Content) using the SAPUI5/OpenUI5 framework",
            "Experience using the SAPUI5 framework to create custom controls such as an image carousel dialog and a pseudo-pivot table",
            "Developed oData services using CDS views (Preview Events, Manage Category Assortments) and ABAP (Manage Offer Content)",
            "One of ~50 early talents from the global early talent pool selected for the second ever cohort of the SAP Academy for Engineering",
            "Credited as one of three inventors for 2 patents created for work done with the Manage Option Plans application"
        ]
    }
]
